{
  "goods": [
    { "type": "jacket",
      "img": "coat01.jpg",
      "name": "ПАЛЬТО УТЕПЛЕННОЕ С ВОРОТНИКОМ СТОЙКОЙ",
      "description": "Надежным выбором для сохранения тепла и комфорта в морозные дни послужит утепленное пальто. Утеплитель Downfill обладает высокими теплоизолирующими свойствами, отлично держит форму и восстанавливает первоначальный объем. Дополнительный комфорт придают внутренние манжеты по низу рукавов, обеспечивающие плотное прилегание к запястьям и теплозащиту. Изделие легко впишется в гардероб и будет актуальным в этом и в последующих сезонах."
    },
    {
      "type": "sweater",
      "img": "sweater01.jpg",
      "name": "ДЖЕМПЕР ПРЯМОГО СИЛУЭТА С ШЕРСТЬЮ",
      "description": "Уютный и теплый джемпер из тонкой пряжи - идеальный вариант для того, чтобы утеплиться перед морозной погодой. Натуральная шерсть в составе приятна на ощупь и отличается непревзойденной теплоизоляцией, воздухопроницаемостью и мягкостью. Джемпер оснащен воротником-стойкой, который служит дополнительной защитой от ветра, обеспечивая максимальный комфорт в холодное время года."
    },
    { "type": "sweater",
      "img": "sweater02.jpg",
      "name": "ДЖЕМПЕР С ШЕРСТЬЮ, цвет Бежевый",
      "description": "Уютный и теплый джемпер из тонкой пряжи - идеальный вариант для того, чтобы утеплиться перед морозной погодой. Натуральная шерсть в составе приятна на ощупь и отличается непревзойденной теплоизоляцией, воздухопроницаемостью и мягкостью. Эластичный низ гарантирует комфортную посадку по фигуре, а свободный силуэт не ограничивает движений, делая модель отличным выбором для повседневной носки."
    },
    {  "type": "sweater",
      "img": "sweater03.jpg",
      "name": "ДЖЕМПЕР С ШЕРСТЬЮ, цвет Хаки",
      "description": "Уютный и теплый джемпер из тонкой пряжи - идеальный вариант для того, чтобы утеплиться перед морозной погодой. Натуральная шерсть в составе приятна на ощупь и отличается непревзойденной теплоизоляцией, воздухопроницаемостью и мягкостью. Эластичный низ гарантирует комфортную посадку по фигуре, а свободный силуэт не ограничивает движений, делая модель отличным выбором для повседневной носки."
    },
    { "type": "jacket",
      "img": "jacket01.jpg",
      "name": "КУРТКА УТЕПЛЕННАЯ С КАПЮШОНОМ",
      "description": "Надежным выбором для сохранения тепла и комфорта в морозные дни послужит утепленная куртка. Утеплитель Downfill обладает высокими теплоизолирующими свойствами, отлично держит форму и восстанавливает первоначальный объем. Дополнительный комфорт придают внутренние манжеты, обеспечивающие плотное прилегание к запястьям и защиту рук от холода. Изделие легко впишется в гардероб и будет актуальным в этом и в последующих сезонах."
    },
    { "type": "shoes",
      "img": "shoes01.jpg",
      "name": "Зимние черные ботинки на шнуровке и молнии Лидер",
      "description": "Ботинки из мягкой и гладкой кожи с английской колодкой безупречно сидят и великолепно смотрятся. Внутри модель утеплена мехом, благодаря которому даже долгое пребывание на свежем воздухе будет комфортным. Высокая шнуровка обеспечивает надежную посадку, боковая молния - удобство надевания. Подошва из полиуретановой основы и внешнего резинового слоя прекрасно амортизирует, предотвращает скольжение и значительно продлевает срок службы обуви. Деталь: в пяточной зоне предусмотрена мягкая эластичная вставка."
    },
    { "type": "shoes",
      "img": "shoes02.jpg",
      "name": "Зимние низкие ботинки из зерненой кожи Лидер",
      "description": "Уверенные. Повседневные ботинки из мягкой зерненой кожи адаптировали для зимы. Модель утеплена густой стриженой овчиной, хорошо удерживающей тепло. Благодаря эластикам пара приспосабливается к особенностям стопы, а для удобства надевания предусмотрена боковая молния. Двухкомпонентная подошва сочетает полиуретановую основу и внешний резиновый слой: упругий полиуретан создает эффект легкого шага, а резина в ходовой части предотвращает скольжение и значительно продлевает срок службы обуви. Отрезной нос и выступающая подошва добавляют нотку ретро."
    }
  ]
}